CSI API ETABS v1
cAreaObj.GetEdgeConstraint Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetEdgeConstraint(
	string Name,
	ref bool ConstraintExists
)
Function GetEdgeConstraint (
	Name As String,
	ByRef ConstraintExists As Boolean
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim ConstraintExists As Boolean
Dim returnValue As Integer
returnValue = instance.GetEdgeConstraint(Name,
	ConstraintExists)
int GetEdgeConstraint(
	String^ Name,
	bool% ConstraintExists
)
abstract GetEdgeConstraint :
        Name : string *
        ConstraintExists : bool byref -> int
Parameters
Name
Type: System.String
ConstraintExists
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace